content/notes/iitm/pcuj.md
+++
title = "Programming Concpets Using Java"
author = ["John Doe"]
draft = false
toc = true
math = true
+++

## Introduction {#introduction}


### Subtyping vs Inheritance {#subtyping-vs-inheritance}

-   Class hierarchy represents both **subtyping** and **Inheritance**. <br/>
-   Subtyping <br/>
    -   Compatibility of interfaces. <br/>
    -   **B** is a subtype of **A** if every function that can be invoked on an object of type **A** can be also be invoked on an object of type B. <br/>

-   Inheritance <br/>
    -   Reuse of implementations. <br/>
    -   **B** inherits from **A** if some functions for **B** are written in terms of functions of **A** <br/>

